Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions
The Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions class is an extension class for all inter-operation conversion methods related to the picker.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.PickTypeStringMapping
The dictionary mapping string values to Tekla.BIM.DirectManipulation.Services.Picking.PickType values.
Mapping is based on a search for "acmd_getinputinfo" in "mdl_create_commands.ail" and in "gr_commands.ail".

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.ToPickType(System.String)
Converts the given pickTypeString to a value of the Tekla.BIM.DirectManipulation.Services.Picking.PickType enum.
pickTypeString: The System.String to convert.
Returns: The matching value of the Tekla.BIM.DirectManipulation.Services.Picking.PickType enum.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.Convert(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType)
Converts a value of Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType to a value of Tekla.BIM.DirectManipulation.Services.Picking.PickType.
dotPickType: The value to convert.
Returns: The converted value.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.Convert(Tekla.BIM.DirectManipulation.Services.Picking.PickType)
Converts a value of Tekla.BIM.DirectManipulation.Services.Picking.PickType to a value of Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickType.
pickType: The value to convert.
Returns: The converted value.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.Convert(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t)
Converts an instance of Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t to an instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject.
eventData: The event data to convert.
Returns: The converted tolerated object.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.GetPickedObject(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t)
Gets the eventData as a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject or null if no data is provided.
eventData: The event data to convert.
Returns: An instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedObject or null.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.GetPickedLine(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t)
Gets the eventData as a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine or null if no relevant data is provided.
eventData: The event data to convert.
Returns: An instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedLine or null.

Tekla.Structures.DirectManipulation.Adapter.Picker.InterOpExtensions.GetPickedFace(Tekla.Structures.DirectManipulation.Adapter.Picker.Native.dotDMPickedObjects_t)
Gets the eventData as a Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace or null if no relevant data is provided.
eventData: The event data to convert.
Returns: An instance of Tekla.BIM.DirectManipulation.Services.Toleration.ToleratedFace or null.